Description: Downloads the latest version of grpcurl from Github (https://github.com/fullstorydev/grpcurl) and builds a package. Set ARCH to either arm64 or x86_64.
Identifier: com.github.kevinmcox.pkg.grpcurl
ParentRecipe: com.github.kevinmcox.download.grpcurl
MinimumVersion: "2.9.0"

Input:
  NAME: grpcurl
  ARCH: x86_64

Process:
  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      purge_destination: true

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
      pkgdirs:
        usr/local/bin: "0755"

  - Processor: FileMover
    Arguments:
      source: "%RECIPE_CACHE_DIR%/unpack/grpcurl"
      target: "%RECIPE_CACHE_DIR%/pkgroot/usr/local/bin/grpcurl"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%ARCH%-%version%"
        pkgdir: "%RECIPE_CACHE_DIR%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        id: com.fullstory.grpcurl
        version: "%version%"
        chown:
          - path: "/usr/local/bin/grpcurl"
            user: root
            group: wheel
            mode: "0755"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
