<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Neo Network Utility.</string>
	<key>Identifier</key>
	<string>com.github.kevinmcox.download.NeoNetworkUtility</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>NeoNetworkUtility</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.devontechnologies.com/apps/freeware</string>
				<key>re_pattern</key>
				<string>'(https://.*Neo_Network_Utility\.dmg\.zip)'</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%match%</string>
				<key>filename</key>
				<string>%NAME%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchived</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/unarchived/Neo_Network_Utility.dmg/Network Utility.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.devon-technologies.network-utility" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "679S2QUWR8")</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
