<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of websocat (https://github.com/vi/websocat), packages it and imports it into Munki.
	Set ARCH to either "aarch64" (default) for Apple Silicon or "x86_64" for Intel.</string>
	<key>Identifier</key>
	<string>com.github.kevinmcox.munki.websocat</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>websocat</string>
		<key>ARCH</key>
		<string>x86_64</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>utilities</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Utilities</string>
			<key>description</key>
			<string>Command-line client for WebSockets, like netcat (or curl) for ws:// with advanced socat-like functions. For more information visit: https://github.com/vi/websocat</string>
			<key>developer</key>
			<string>Vitaly Shukela</string>
			<key>display_name</key>
			<string>websocat</string>
			<key>icon_name</key>
			<string>%NAME%.png</string>
			<key>minimum_os_version</key>
			<string>10.15</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>uninstallable</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7.3</string>
	<key>ParentRecipe</key>
	<string>com.github.kevinmcox.pkg.websocat</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>aarch64</string>
				<key>input_string</key>
				<string>%ARCH%</string>
				<key>replace</key>
				<string>arm64</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>supported_architectures</key>
					<array>
						<string>%output_string%</string>
					</array>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/pkg_root</string>
				<key>installs_item_paths</key>
				<array>
					<string>/usr/local/bin/websocat</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/pkg_root</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
