<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of websocat (https://github.com/vi/websocat).
	Set ARCH to either "aarch64" (default) for Apple Silicon or "x86_64" for Intel.</string>
	<key>Identifier</key>
	<string>com.github.kevinmcox.download.websocat</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>websocat</string>
		<key>ARCH</key>
		<string>aarch64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>.*%ARCH%-apple-darwin$</string>
				<key>github_repo</key>
				<string>vi/websocat</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>websocat</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
