Description: Downloads the latest version of dotslash from Github (https://github.com/facebook/dotslash) and builds a package. Set ARCH to either universal, arm64 or x86_64.
Identifier: com.github.kevinmcox.pkg.dotslash
ParentRecipe: com.github.kevinmcox.download.dotslash
MinimumVersion: "2.9.0"

Input:
  NAME: dotslash
  ARCH: arm64

Process:
  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      purge_destination: true

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
      pkgdirs:
        usr/local/bin: "0755"

  - Processor: FileMover
    Arguments:
      source: "%RECIPE_CACHE_DIR%/unpack/dotslash"
      target: "%RECIPE_CACHE_DIR%/pkgroot/usr/local/bin/dotslash"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%ARCH%-%version%"
        pkgdir: "%RECIPE_CACHE_DIR%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        id: com.meta.dotslash
        version: "%version%"
        chown:
          - path: "/usr/local/bin/dotslash"
            user: root
            group: wheel
            mode: "0755"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
