Description: Downloads the latest version of Tart from Github. Code Signature Verification is disabled due to broken code signing by the developer.
Identifier: com.github.kevinmcox.download.Tart
MinimumVersion: '2.7'

Input:
  NAME: Tart
  DISABLE_CODE_SIGNATURE_VERIFICATION: true

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      asset_regex: ^tart.tar.gz$
      github_repo: cirruslabs/tart

  - Processor: URLDownloader

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/unpack/Tart.app"
      requirement: >-
        identifier tart and anchor apple generic and
        certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and
        certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
        certificate leaf[subject.OU] = "9M2P8L4D89"
