Description: Downloads the latest version of Amazon ECR Credential Helper. Set ARCH to either arm64 or x86_64.
Identifier: com.github.kevinmcox.download.AmazonECRCredentialHelper
MinimumVersion: 2.7.6

Input:
  NAME: AmazonECRCredentialHelper
  ARCH: arm64


Process:
  - Processor: FindAndReplace
    Arguments:
      find: x86_64
      input_string: "%ARCH%"
      replace: amd64
      result_output_var_name: DOWNLOAD_ARCH

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: /releases/tag/v?([\d.]+)
      result_output_var_name: version
      url: https://github.com/awslabs/amazon-ecr-credential-helper/releases/latest

  - Processor: URLTextSearcher
    Arguments:
      re_pattern: href=\"(https://amazon-ecr-credential-helper-releases\.s3\.[^\"/]+\.amazonaws\.com/[0-9]+\.[0-9]+\.[0-9]+/darwin-%DOWNLOAD_ARCH%/docker-credential-ecr-login)\"
      result_output_var_name: link
      url: https://github.com/awslabs/amazon-ecr-credential-helper/releases/latest

  - Processor: URLDownloader
    Arguments:
      url: '%link%'
      filename: docker-credential-ecr-login

  - Processor: EndOfCheckPhase
