Description: Downloads the latest version of Amazon ECR Credential Helper and packages it. Set ARCH to either arm64 or x86_64.
Identifier: com.github.kevinmcox.pkg.AmazonECRCredentialHelper
ParentRecipe: com.github.kevinmcox.download.AmazonECRCredentialHelper
MinimumVersion: 2.7.6

Input:
  NAME: AmazonECRCredentialHelper
  ARCH: arm64

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
      pkgdirs:
        usr/local/bin: "0755"

  - Processor: Copier
    Arguments:
      source_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/pkgroot/usr/local/bin/docker-credential-ecr-login"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%version%"
        pkgdir: "%RECIPE_CACHE_DIR%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        id: com.amazon.docker-credential-ecr-login
        version: "%version%"
        chown:
          - path: "/usr/local/bin/docker-credential-ecr-login"
            user: root
            group: wheel
            mode: "0755"
