Description: Downloads the latest version of Amazon ECR Credential Helper, packages it and imports it into Munki. Set ARCH to either arm64 or x86_64.
Identifier: com.github.kevinmcox.munki.AmazonECRCredentialHelper
ParentRecipe: com.github.kevinmcox.pkg.AmazonECRCredentialHelper
MinimumVersion: 2.7.6

Input:
  NAME: AmazonECRCredentialHelper
  ARCH: arm64
  MUNKI_CATEGORY: Utilities
  MUNKI_REPO_SUBDIR: Amazon/%NAME%/%ARCH%

  pkginfo:
    catalogs:
      - testing
    category: "%MUNKI_CATEGORY%"
    description: Automatically gets credentials for Amazon ECR on docker push/docker pull.
    developer: Amazon Web Services
    display_name: Amazon ECR Credential Helper
    name: "%NAME%"
    supported_architectures:
      - "%ARCH%"
    unattended_install: true
    unattended_uninstall: true

Process:
  - Processor: MunkiInstallsItemsCreator
    Arguments:
      faux_root: "%RECIPE_CACHE_DIR%/pkgroot"
      installs_item_paths:
        - /usr/local/bin/docker-credential-ecr-login

  - Processor: MunkiPkginfoMerger

  - Processor: MunkiPkginfoMerger
    Arguments:
      additional_pkginfo:
        version: "%version%"

  - Processor: MunkiImporter
    Arguments:
      pkg_path: "%pkg_path%"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/pkgroot"
