<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Addigy's MDM Watchdog and imports it into Munki.</string>
		<key>Identifier</key>
		<string>com.github.kevinmcox.munki.mdm-watchdog</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>management/mdm-watchdog</string>
			<key>NAME</key>
			<string>mdm-watchdog</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>Management</string>
				<key>description</key>
				<string>MDM Watchdog safeguards the health and responsiveness of your macOS fleet by addressing and resolving stuck devices, ensuring seamless device management and communication.</string>
				<key>developer</key>
				<string>Addigy, Inc.</string>
				<key>display_name</key>
				<string>MDM Watchdog</string>
				<key>icon_name</key>
				<string>mdm-watchdog.png</string>
				<key>minimum_os_version</key>
				<string>10.15</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>preuninstall_script</key>
				<string>#!/bin/sh

launchDaemon=/Library/LaunchDaemons/com.addigy.mdm-watchdog.plist

if	[ -e "${launchDaemon}" ]; then
	/bin/launchctl bootout system "${launchDaemon}"
fi				</string>
				<key>unattended_install</key>
				<true/>
				<key>unattended_uninstall</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>2.7.2</string>
		<key>ParentRecipe</key>
		<string>com.github.kevinmcox.download.mdm-watchdog</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<key>flat_pkg_path</key>
					<string>%pathname%</string>
					<key>purge_destination</key>
					<true/>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/</string>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/mdm-watchdog-component.pkg/payload</string>
					<key>purge_destination</key>
					<true/>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiInstallsItemsCreator</string>
				<key>Arguments</key>
				<dict>
					<key>faux_root</key>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<key>installs_item_paths</key>
					<array>
						<string>/usr/local/bin/mdm-watchdog</string>
					</array>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PathDeleter</string>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/payload</string>
						<string>%RECIPE_CACHE_DIR%/unpack</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
