<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the latest version of Kreya.
	Set ARCH to "arm64" for Apple Silicon (default) or "x64" for Intel.</string>
	<key>Identifier</key>
	<string>com.github.kevinmcox.install.Kreya</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Kreya</string>
		<key>ARCH</key>
		<string>arm64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7.0</string>
	<key>ParentRecipe</key>
	<string>com.github.kevinmcox.download.Kreya</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe is deprecated because of changes to the parent. If you use it let me know and I'll update it instead of deleting it.</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
