<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Kreya and imports it into Munki.
	Set ARCH to "arm64" for Apple Silicon (default) or "x64" for Intel.</string>
	<key>Identifier</key>
	<string>com.github.kevinmcox.munki.Kreya</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Kreya</string>
		<key>ARCH</key>
		<string>arm64</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/Kreya/%ARCH%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Development</string>
			<key>description</key>
			<string>Kreya is a GUI client for gRPC and REST APIs with innovative features for environments, authorizations and more.</string>
			<key>developer</key>
			<string>riok GmbH</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>icon_name</key>
			<string>%NAME%.png</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>minimum_os_version</key>
			<string>13.0</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>uninstallable</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7.6</string>
	<key>ParentRecipe</key>
	<string>com.github.kevinmcox.download.Kreya</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>input_string</key>
				<string>%ARCH%</string>
				<key>find</key>
				<string>x64</string>
				<key>replace</key>
				<string>x86_64</string>
				<key>result_output_var_name</key>
				<string>supported_arch</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>supported_architectures</key>
					<array>
						<string>%supported_arch%</string>
					</array>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
