<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Installs the latest version of Kreya.
	Set ARCH to "arm64" for Apple Silicon (default) or "x64" for Intel.</string>
	<key>Identifier</key>
	<string>com.github.kevinmcox.install.Kreya</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Kreya</string>
		<key>ARCH</key>
		<string>arm64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7.0</string>
	<key>ParentRecipe</key>
	<string>com.github.kevinmcox.download.Kreya</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>FileMover</string>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Kreya.app</string>
				<key>target</key>
				<string>/Applications/Kreya.app</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
