<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Dizzion (formerly Nutanix) Frame.</string>
		<key>Identifier</key>
		<string>com.github.kevinmcox.download.Frame</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Frame</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>Frame\sApp\sfor\smacOS&lt;/td&gt;&lt;td&gt;\d\.\d\.\d</string>
					<key>result_output_var_name</key>
					<string>regex_output</string>
					<key>url</key>
					<string>https://docs.dizzion.com/downloads</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
				<key>Arguments</key>
				<dict>
					<key>find</key>
					<string>Frame App for macOS&lt;/td&gt;&lt;td&gt;</string>
					<key>input_string</key>
					<string>%regex_output%</string>
					<key>replace</key>
					<string></string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://prod-sup-5683567dcbd60804cb34.s3.amazonaws.com/Frame+App/%output_string%/darwin/x64/Frame-%output_string%-x64.dmg</string>
					<key>filename</key>
					<string>Frame.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/Frame.app</string>
					<key>requirement</key>
					<string>identifier "frame.application" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "74Z7ZNLP82"</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Versioner</string>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%pathname%/Frame.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleVersion</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
