<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Dizzion (formerly Nutanix) Frame. Set ARCH to arm64 or x86_64.</string>
	<key>Identifier</key>
	<string>com.github.kevinmcox.download.Frame</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Frame</string>
		<key>ARCH</key>
		<string>arm64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7.6</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(?si)&lt;td[^&gt;]*&gt;\s*Frame\s+App\s+\d+\.x\s+for\s+macos\s*\(arm64\)\s*&lt;/td&gt;\s*&lt;td&gt;\s*([0-9]+(?:\.[0-9]+){2})\s*&lt;/td&gt;</string>
				<key>result_output_var_name</key>
				<string>DOWNLOAD_VERSION</string>
				<key>url</key>
				<string>https://docs.dizzion.com/downloads</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>x86_64</string>
				<key>input_string</key>
				<string>%ARCH%</string>
				<key>replace</key>
				<string>x64</string>
				<key>result_output_var_name</key>
				<string>DOWNLOAD_ARCH</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://prod-sup-5683567dcbd60804cb34.s3.amazonaws.com/Frame+App/%DOWNLOAD_VERSION%/darwin/%DOWNLOAD_ARCH%/Frame-%DOWNLOAD_VERSION%-%DOWNLOAD_ARCH%.dmg</string>
				<key>filename</key>
				<string>Frame-%ARCH%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Frame.app</string>
				<key>requirement</key>
				<string>identifier "frame.application" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "74Z7ZNLP82"</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Versioner</string>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Frame.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
