<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of DFU Blaster.</string>
		<key>Identifier</key>
		<string>com.github.kevinmcox.download.DFUBlaster</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>DFUBlaster</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.7.2</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>href="(/twocanoes/dfu-blaster-public/downloads/PreBeta-DFU_Blaster_Build-[\d]+_Version-[\d.]+dmg)</string>
					<key>url</key>
					<string>https://bitbucket.org/twocanoes/dfu-blaster-public/downloads/</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://bitbucket.org%match%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Twocanoes Software, Inc. (UXP6YEHSPW)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
					<key>input_path</key>
					<string>%pathname%/DFU Blaster.pkg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
