Description: Downloads the latest version of Password Utility (https://twocanoes.com/products/mac/password-utility/).
Identifier: com.github.kevinmcox.download.PasswordUtility
MinimumVersion: 2.7.6

Input:
  NAME: PasswordUtility

Process:
  - Processor: URLDownloader
    Arguments:
      url: https://twocanoes-software-updates.s3.amazonaws.com/Password_Utility.pkg

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Twocanoes Software, Inc. (UXP6YEHSPW)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: '%pathname%'
