Description: Downloads the latest version of Password Utility (https://twocanoes.com/products/mac/password-utility/) and imports it into Munki.
Identifier: com.github.kevinmcox.munki.PasswordUtility
ParentRecipe: com.github.kevinmcox.download.PasswordUtility
MinimumVersion: 2.7.6

Input:
  NAME: PasswordUtility
  MUNKI_REPO_SUBDIR: Twocanoes/%NAME%

  pkginfo:
    catalogs:
      - testing
    category: Utilities
    description: Password Utility makes it simple to unlock FileVault automatically after a restart or power failure. The Mac system will immediately be available on the network.
    developer: Twocanoes Software
    display_name: Password Utility
    icon_name: '%NAME%.png'
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true
    uninstall_method: uninstall_script
    uninstall_script: |
      #!/bin/sh
      /Applications/FilevaultLogin.app/Contents/Resources/setup.sh -r
      /bin/rm -rf /Applications/FilevaultLogin.app

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/unpack'
      flat_pkg_path: '%pathname%'
      purge_destination: true

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: '%RECIPE_CACHE_DIR%/payload'
      pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Password_Utility.pkg/payload'
      purge_destination: true

  - Processor: MunkiInstallsItemsCreator
    Arguments:
      derive_minimum_os_version: true
      faux_root: '%RECIPE_CACHE_DIR%/payload'
      installs_item_paths:
        - /Applications/Password Utility.app
      version_comparison_key: CFBundleVersion

  - Processor: MunkiPkginfoMerger

  - Processor: MunkiImporter
    Arguments:
      pkg_path: '%pathname%'
      repo_subdirectory: '%MUNKI_REPO_SUBDIR%'

  - Processor: PathDeleter
    Arguments:
      path_list:
        - '%RECIPE_CACHE_DIR%/payload/'
        - '%RECIPE_CACHE_DIR%/unpack'
