Description: Downloads the Contour (https://github.com/headmin/contour) package.
Identifier: com.github.kevinmcox.download.Contour
MinimumVersion: "2.9.0"

Input:
  NAME: Contour

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: headmin/contour
      asset_regex: 'contour-.*pkg'

  - Processor: URLDownloader

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - 'Developer ID Installer: Mac Admins Open Source (T4SK8ZXCXG)'
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: "%pathname%"
