Description: Downloads the latest version of ConductorOne's CLI tool Cone and packages it. Set ARCH to either arm64 or x86_64.
Identifier: com.github.kevinmcox.pkg.Cone
ParentRecipe: com.github.kevinmcox.download.Cone
MinimumVersion: 2.7.6

Input:
  NAME: Cone
  ARCH: arm64

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
      pkgdirs:
        usr/local/bin: "0755"

  - Processor: FileMover
    Arguments:
      source: "%RECIPE_CACHE_DIR%/unpack/cone"
      target: "%RECIPE_CACHE_DIR%/pkgroot/usr/local/bin/cone"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%ARCH%-%version%"
        pkgdir: "%RECIPE_CACHE_DIR%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        id: com.conductorone.cone
        version: "%version%"
        chown:
          - path: "/usr/local/bin/cone"
            user: root
            group: wheel
            mode: "0755"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
