<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of HiDock and creates a package.</string>
		<key>Identifier</key>
		<string>com.github.kevinmcox.pkg.HiDock</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>HiDock</string>
		</dict>
		<key>MinimumVersion</key>
		<string>2.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.kevinmcox.download.HiDock</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-pkg</string>
					<key>pkgdirs</key>
					<dict>
						<key>Applications</key>
						<string>0775</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Copier</string>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/Applications/</string>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
					<key>overwrite</key>
					<true/>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PlistReader</string>
				<key>Arguments</key>
				<dict>
					<key>info_path</key>
					<string>%pkgroot%/Applications/HiDock.app</string>
					<key>plist_keys</key>
					<dict>
						<key>CFBundleShortVersionString</key>
						<string>version</string>
						<key>CFBundleIdentifier</key>
						<string>bundleid</string>
						<key>CFBundleName</key>
						<string>app_name</string>
						<key>LSMinimumSystemVersion</key>
						<string>min_os_version</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>pkgname</key>
						<string>%NAME%-%version%</string>
						<key>pkgdir</key>
						<string>%RECIPE_CACHE_DIR%</string>
						<key>id</key>
						<string>%bundleid%</string>
						<key>chown</key>
						<array>
							<dict>
								<key>path</key>
								<string>Applications</string>
								<key>user</key>
								<string>root</string>
								<key>group</key>
								<string>admin</string>
							</dict>
						</array>
					</dict>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
