<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of HiDock and imports it into Munki.</string>
		<key>Identifier</key>
		<string>com.github.kevinmcox.munki.HiDock</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>HiDock</string>
			<key>MUNKI_CATEGORY</key>
			<string>Utilities</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>utilities</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>Set custom Dock settings for when on different displays.</string>
				<key>developer</key>
				<string>Rafael Conde</string>
				<key>display_name</key>
				<string>%NAME%</string>
				<key>icon_name</key>
				<string>%NAME%.png</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
				<key>unattended_uninstall</key>
				<true/>
				<key>uninstallable</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>2.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.kevinmcox.download.HiDock</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>DmgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>dmg_root</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>dmg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%dmg_path%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
					<key>version_comparison_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
