<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Android Studio IDE from Google.

	For Apple Silicon set ARCH to "arm64" (default) and for Intel set ARCH to "x86_64".

	NOTE: This recipe differs from others in that it allows for the import and distribution of "patch" versions (not just major/minor) of Android Studio. It also allows for a single architecture variable to be used for both the download and Munki.
	</string>
	<key>Identifier</key>
	<string>com.github.kevinmcox.download.AndroidStudio</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>arm64</string>
		<key>NAME</key>
		<string>AndroidStudio</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7.6</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>input_string</key>
				<string>%ARCH%</string>
				<key>find</key>
				<string>arm64</string>
				<key>replace</key>
				<string>mac_arm</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>input_string</key>
				<string>%output_string%</string>
				<key>find</key>
				<string>x86_64</string>
				<key>replace</key>
				<string>mac</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>re_pattern</key>
				<string>([0-9]+(?:\.[0-9]+)+)(?=/android-studio-\1-%output_string%\.dmg)</string>
				<key>url</key>
				<string>https://developer.android.com/studio</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>re_pattern</key>
				<string>(https\://redirector\.gvt1\.com/edgedl/android/studio/install/.+/android-studio.+%output_string%\.dmg)</string>
				<key>url</key>
				<string>https://developer.android.com/studio</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%ARCH%-%version%.dmg</string>
				<key>url</key>
				<string>%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
				<key>requirement</key>
				<string>identifier "com.google.android.studio" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EQHXZ8M8AV</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
