<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Google Endpoint Verification Helper.</string>
		<key>Identifier</key>
		<string>com.github.kevinmcox.download.GoogleEndpointVerificationHelper</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>GoogleEndpointVerificationHelper</string>
			<key>PKG_URL</key>
			<string>https://dl.google.com/dl/secureconnect/install/mac/EndpointVerification.dmg</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%PKG_URL%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Google LLC (EQHXZ8M8AV)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
					<key>input_path</key>
					<string>%pathname%/EndpointVerification.pkg</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
