Description: "Downloads the latest version of Google Workspace CLI (gws) from https://github.com/googleworkspace/cli and builds a package."
Identifier: com.github.kevinmcox.pkg.GoogleWorkspaceCLI
ParentRecipe: com.github.kevinmcox.download.GoogleWorkspaceCLI
MinimumVersion: "2.9.0"

Input:
  NAME: GoogleWorkspaceCLI
  ARCH: arm64

Process:
  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      purge_destination: true

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
      pkgdirs:
        usr/local/bin: "0755"

  - Processor: FileMover
    Arguments:
      source: "%RECIPE_CACHE_DIR%/unpack/gws"
      target: "%RECIPE_CACHE_DIR%/pkgroot/usr/local/bin/gws"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%ARCH%-%version%"
        pkgdir: "%RECIPE_CACHE_DIR%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        id: com.google.gws
        version: "%version%"
        chown:
          - path: usr/local/bin/gws
            user: root
            group: wheel
            mode: "0755"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
