<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Google Endpoint Verification Helper and imports it into Munki.</string>
		<key>Identifier</key>
		<string>com.github.kevinmcox.munki.GoogleEndpointVerificationHelper</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>management/GoogleEndpointVerification</string>
			<key>NAME</key>
			<string>GoogleEndpointVerificationHelper</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>Management</string>
				<key>description</key>
				<string>Google Endpoint Verification helps IT keep your computer secure.</string>
				<key>developer</key>
				<string>Google</string>
				<key>display_name</key>
				<string>Google Endpoint Verification</string>
				<key>icon_name</key>
				<string>GoogleEndpointVerificationHelper.png</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
				<key>unattended_uninstall</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.kevinmcox.download.GoogleEndpointVerificationHelper</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
					<key>flat_pkg_path</key>
					<string>%pathname%/EndpointVerification.pkg</string>
					<key>purge_destination</key>
					<true/>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/</string>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/Endpoint_Verification_Native_Helper.pkg/payload</string>
					<key>purge_destination</key>
					<true/>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiInstallsItemsCreator</string>
				<key>Arguments</key>
				<dict>
					<key>faux_root</key>
					<string>%RECIPE_CACHE_DIR%/payload</string>
					<key>installs_item_paths</key>
					<array>
						<string>/Library/Application Support/Google/Endpoint Verification/ApiHelper</string>
					</array>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
