<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Adobe's Creative Cloud Desktop App installer.
	Set ARCH to "arm64" for Apple Silicon or "x86_64" for Intel.</string>
	<key>Identifier</key>
	<string>com.github.kevinmcox.download.AdobeCreativeCloudDesktop</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>arm64</string>
		<key>NAME</key>
		<string>AdobeCCDA</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7.6</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>arm64</string>
				<key>input_string</key>
				<string>%ARCH%</string>
				<key>replace</key>
				<string>macarm64</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FindAndReplace</string>
			<key>Arguments</key>
			<dict>
				<key>find</key>
				<string>x86_64</string>
				<key>input_string</key>
				<string>%output_string%</string>
				<key>replace</key>
				<string>osx10</string>
				<key>result_output_var_name</key>
				<string>DOWNLOAD_ARCH</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://helpx.adobe.com/download-install/apps/download-install-apps/creative-cloud-apps/download-creative-cloud-desktop-app-using-direct-links.html</string>
				<key>re_pattern</key>
				<string>(?P&lt;url&gt;http.*?://ccmdls?.adobe.com/AdobeProducts/StandaloneBuilds/ACCC/ESD/.*?/%DOWNLOAD_ARCH%/ACCC.*?.dmg)</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Install.app</string>
				<key>requirement</key>
				<string>identifier "com.adobe.cc.Install" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = JQ525L2MZD</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%pathname%/packages/ApplicationInfo.xml</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/ApplicationInfo.xml</string>
				<key>overwrite</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>XMLReader</string>
			<key>Arguments</key>
			<dict>
				<key>xml_path</key>
				<string>%RECIPE_CACHE_DIR%/ApplicationInfo.xml</string>
				<key>elements</key>
				<array>
					<dict>
						<key>xpath</key>
						<string>version</string>
						<key>text</key>
						<string>version</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
