Description: Downloads the latest version of the Helm CLI and builds a package. Set ARCH to either arm64 or x86_64.
Identifier: com.github.kevinmcox.pkg.Helm
ParentRecipe: com.github.kevinmcox.download.Helm
MinimumVersion: "2.9.0"

Input:
  NAME: Helm
  ARCH: arm64

Process:
  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      purge_destination: true

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
      pkgdirs:
        usr/local/bin: "0755"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unpack/*/helm"

  - Processor: FileMover
    Arguments:
      source: "%found_filename%"
      target: "%RECIPE_CACHE_DIR%/pkgroot/usr/local/bin/helm"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%ARCH%-%version%"
        pkgdir: "%RECIPE_CACHE_DIR%"
        pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"
        id: sh.helm.helm
        version: "%version%"
        chown:
          - path: usr/local/bin/helm
            user: root
            group: wheel
            mode: "0755"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
