<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of okta-aws-cli (https://github.com/okta/okta-aws-cli).
	Set ARCH to either "arm64" (default) for Apple Silicon or "amd64" for Intel.</string>
	<key>Identifier</key>
	<string>com.github.kevinmcox.download.okta-aws-cli</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>okta-aws-cli</string>
		<key>ARCH</key>
		<string>arm64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>.*darwin_%ARCH%\.tar\.gz$</string>
				<key>github_repo</key>
				<string>okta/okta-aws-cli</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%ARCH%-%version%.tar.gz</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
