<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Photo Mechanic Plus and imports it into Munki.</string>
		<key>Identifier</key>
		<string>com.github.kevinmcox.munki.PhotoMechanicPlus</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/PhotoMechanic</string>
			<key>NAME</key>
			<string>Photo Mechanic Plus</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>Photography</string>
				<key>description</key>
				<string>Photo Mechanic Plus, currently in public beta, is an upcoming version of Photo Mechanic 6 that includes a digital asset management catalog feature.</string>
				<key>developer</key>
				<string>Camera Bits, Inc.</string>
				<key>display_name</key>
				<string>Photo Mechanic Plus</string>
				<key>icon_name</key>
				<string>%NAME%.png</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
				<key>unattended_uninstall</key>
				<true/>
				<key>uninstallable</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.kevinmcox.download.PhotoMechanicPlus</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>version</key>
						<string>%version%</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
					<key>version_comparison_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>