<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Photo Mechanic 5.</string>
		<key>Identifier</key>
		<string>com.github.kevinmcox.download.PhotoMechanic5</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Photo Mechanic 5</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://www.camerabits.com/cgi-bin/download_pm.cgi?plat=mac</string>
					<key>re_pattern</key>
					<string>(?&lt;=\(build\s)(.*?)(?=\))</string>
					<key>result_output_var_name</key>
					<string>build</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://www.camerabits.com/download/PhotoMechanic5R%build%.dmg</string>
					<key>filename</key>
					<string>PhotoMechanic5.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/Photo Mechanic 5.app</string>
					<key>requirement</key>
					<string>anchor apple generic and identifier "com.camerabits.PhotoMechanic" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "628DA53678")</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Versioner</string>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%pathname%/Photo Mechanic 5.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>