<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release, of the specified major version, of Teleport.</string>
	<key>Identifier</key>
	<string>com.github.kevinmcox.download.Teleport</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>17</string>
		<key>NAME</key>
		<string>Teleport</string>
	</dict>
	<key>MiniumumVersion</key>
	<string>2.0</string>
	<key>Process</key>
	<array>
		<dict>
		<key>Processor</key>
		<string>URLTextSearcher</string>
		<key>Arguments</key>
		<dict>
			<key>url</key>
			<string>https://github.com/gravitational/teleport/releases</string>
			<key>re_pattern</key>
			<string>href=\"/gravitational/teleport/releases/tag/v(%MAJOR_VERSION%+(\.[0-9]+)+)\"</string>
			<key>result_output_var_name</key>
			<string>VERSION</string>
		</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://cdn.teleport.dev/teleport-%VERSION%.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
		<key>Processor</key>
		<string>CodeSignatureVerifier</string>
		<key>Arguments</key>
		<dict>
			<key>input_path</key>
			<string>%pathname%</string>
			<key>expected_authority_names</key>
			<array>
				<string>Developer ID Installer: Gravitational Inc. (QH8AA5B8UP)</string>
				<string>Developer ID Certification Authority</string>
				<string>Apple Root CA</string>
			</array>
		</dict>
		</dict>
	</array>
</dict>
</plist>
