<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release, of the specified major version, of Teleport Connect.</string>
	<key>Identifier</key>
	<string>com.github.kevinmcox.download.Teleport.Connect</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>14</string>
		<key>NAME</key>
		<string>TeleportConnect</string>
	</dict>
	<key>MiniumumVersion</key>
	<string>2.0</string>
	<key>Process</key>
	<array>
		<dict>
		<key>Processor</key>
		<string>URLTextSearcher</string>
		<key>Arguments</key>
		<dict>
			<key>url</key>
			<string>https://github.com/gravitational/teleport/releases</string>
			<key>re_pattern</key>
			<string>href=\"/gravitational/teleport/releases/tag/v(%MAJOR_VERSION%+(\.[0-9]+)+)\"</string>
			<key>result_output_var_name</key>
			<string>VERSION</string>
		</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://cdn.teleport.dev/Teleport%20Connect-%VERSION%.dmg</string>
				<key>filename</key>
				<string>TeleportConnect-%VERSION%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Teleport Connect.app</string>
				<key>requirement</key>
				<string>identifier "gravitational.teleport.connect" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = QH8AA5B8UP</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
