<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release, of the specified major version, of the Teleport tsh client and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.kevinmcox.munki.Teleport.tsh</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>16</string>
		<key>NAME</key>
		<string>Teleport-tsh</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>development/Teleport</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Development</string>
			<key>description</key>
			<string>The tsh client lets you authenticate to Teleport and list and connect to resources.</string>
			<key>developer</key>
			<string>Gravitational Inc.</string>
			<key>display_name</key>
			<string>Teleport tsh</string>
			<key>icon_name</key>
			<string>Teleport.png</string>
			<key>minimum_os_version</key>
			<string>13.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postuninstall_script</key>
			<string>#!/bin/sh
if	[ -L /usr/local/bin/tsh ]; then
	/bin/rm -f /usr/local/bin/tsh
fi</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7.2</string>
	<key>ParentRecipe</key>
	<string>com.github.kevinmcox.download.Teleport.tsh</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Applications</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/tsh.app</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--pkgvers</string>
					<string>%VERSION%</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/payload/</string>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
